package com.javaex.practice;

public class Ex05 {

	public static void main(String[] args) {
		// 자바 소스파일(~. java)을 작성할 때 틀린 것을 찾아 수정해보세요
/*
 * 패키지명은 일반적으로 가독성을 위해 대문자, 소문자 섞어 사용한다.
 *  클래스명은 소문자로만 구성하여 작성한다
 *  자바 소스파일(~.java)명과 클래스 이름은 대소문자까지 모두 동일한 단어를 사용해야 한다
 * (실행문 뒤(문자의 끝)에는 반드시 ( : )콜론을 사용해야 한다.
 * 처음으로 실행되는 함수의 이름은 개발자가 임의로 작성해서 만든다
 * 
 */
		
		/* 수정
	패키지 이름은 소문자로 시작해야 합니다.
	클래스 이름은 대문자로 시작해야 합니다.
	자바 소스 파일명과 클래스 이름은 대소문자까지 모두 일치해야 합니다.
	실행문의 끝에는 반드시 세미콜론(;)을 사용해야 합니다.
	처음으로 실행되는 함수(메서드)의 이름은 main으로 작성해야 합니다.	
		 */

	}

}
