package com.javaex.practice;

public class Ex06 {

	public static void main(String[] args) {
	
		// 아래의 설명 중 틀린 것을 찾아서 수정해 보세요.
		/* 수정
		 * ((X) 변수는 한 번에 하나의 값을 저장합니다. 여러 값을 저장하려면 배열이나 컬렉션 등을 사용해야 합니다.
			(O) 변수는 선언할 때 사용한 데이터 타입의 값만 저장할 수 있습니다.
			(O) 변수는 초기화되지 않은 경우에도 읽을 수 있습니다. 그러나 초기화되지 않은 변수를 사용하려고 하면 컴파일 오류가 발생할 수 있습니다.
			(X) 각 자료형은 변수가 저장되는 방식이 다릅니다. 예를 들어, 정수형 변수는 정수 값을 저장하고, 실수형 변수는 실수 값을 저장합니다.
			(O) double형은 float형보다 큰 수를 담을 수 있습니다.
			(X) int, float, char는 기본 자료형(primitive data type)에 속하지만, String은 참조형(reference type)입니다.
			(X) final로 선언된 변수는 수정할 수 없습니다. 즉, 변경이 불가능한 상수입니다.
			(O) long형 변수에 값을 대입할 때에는 'L' 또는 'l'을 붙여서 표기하는 것이 권장됩니다.
			(X) float형 변수에 값을 대입할 때에는 'F' 또는 'f'를 붙여서 표기하는 것이 권장됩니다.

		 */

	}

}
